In [8]:
def is_prime(n):
    count=0
    for num in range(1,(n//2)+1):
        if n%num==0:
            count+=1
    if count==1:
        return True
    else: return False
    
lw=int(input())
up=int(input())
for num in range(lw,up+1):
    if is_prime(num)==True:
        print(num,end=" ")

2
50
2 3 5 7 11 13 17 19 23 29 31 37 41 43 47

In [9]:
for num in range(1,100):
    count=0
    for num2 in range(1,num+1):
        if num%num2==0:
            count+=1
    if count==2:
        print(num,end=" ")

2 3 5 7 11 13 17 19 23 29 31 37 41 43 47 53 59 61 67 71 73 79 83 89 97

In [10]:
lw=int(input())
up=int(input())
for num in range(lw,up+1):
    count=0
    for num2 in range(1,num+1):
        if num%num2==0:
            count+=1
    if count==2:
        print(num,end=" ")

2
40
2 3 5 7 11 13 17 19 23 29 31 37

In [17]:
def is_perfect(n):
    s=0
    for num in range(1,n):
        if n%num==0:
            s+=num
    if s==n:
        return True
    else:
        return False
    
#is_perfect(24)
for num in range(1,1000):
    if is_perfect(num):
        print(num,end=" ")

6 28 496

In [19]:
def perfect_range(lw,up):
    for num in range(lw,up+1):
        s=0
        for num2 in range(1,num):
            if num%num2==0:
                s+=num2
        if s==num:
            print(num,end=" ")
            
perfect_range(1,1000)

6 28 496

##  String Method

In [17]:
st=input()
print("printing alphabets..")
for ch in st:
    if ch.isalpha():
        print(ch,end=" ")
print()
print("Printing digits..")
for ch2 in st:
    if ch2.isnumeric():
        print(ch2,end=" ")

jhghj87
printing alphabets..
j h g h j
Printing digits..
8 7

In [21]:
print("central govt job..\n")

central govt job..

In [1]:
import pandas as pd

df = pd.DataFrame([{'Name': 'Chris', 'Item Purchased': 'Sponge', 'Cost': 22.50},
                   {'Name': 'Kevyn', 'Item Purchased': 'Kitty Litter', 'Cost': 2.50},
                   {'Name': 'Filip', 'Item Purchased': 'Spoon', 'Cost': 5.00}],
                  index=['Store 1', 'Store 1', 'Store 2'])
df

         Cost Item Purchased   Name
Store 1  22.5         Sponge  Chris
Store 1   2.5   Kitty Litter  Kevyn
Store 2   5.0          Spoon  Filip

In [2]:
df['Delivered'] = True
df

         Cost Item Purchased   Name  Delivered
Store 1  22.5         Sponge  Chris       True
Store 1   2.5   Kitty Litter  Kevyn       True
Store 2   5.0          Spoon  Filip       True

In [3]:
df['Delivered'] = True
df

         Cost Item Purchased   Name  Delivered
Store 1  22.5         Sponge  Chris       True
Store 1   2.5   Kitty Litter  Kevyn       True
Store 2   5.0          Spoon  Filip       True

In [4]:
adf = df.reset_index()
adf['Date'] = pd.Series({0: 'December 1', 2: 'mid-May'})
adf

     index  Cost Item Purchased   Name  Delivered        Date
0  Store 1  22.5         Sponge  Chris       True  December 1
1  Store 1   2.5   Kitty Litter  Kevyn       True         NaN
2  Store 2   5.0          Spoon  Filip       True     mid-May

In [5]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR'},
                         {'Name': 'Sally', 'Role': 'Course liasion'},
                         {'Name': 'James', 'Role': 'Grader'}])
staff_df = staff_df.set_index('Name')
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business'},
                           {'Name': 'Mike', 'School': 'Law'},
                           {'Name': 'Sally', 'School': 'Engineering'}])
student_df = student_df.set_index('Name')
print(staff_df.head())
print()
print(student_df.head())

                 Role
Name
Kelly  Director of HR
Sally  Course liasion
James          Grader

            School
Name
James     Business
Mike           Law
Sally  Engineering

In [6]:
pd.merge(staff_df, student_df, how='outer', left_index=True, right_index=True)

                 Role       School
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally  Course liasion  Engineering

In [7]:
pd.merge(staff_df, student_df, how='inner', left_index=True, right_index=True)

                 Role       School
Name
Sally  Course liasion  Engineering
James          Grader     Business

In [8]:
pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)

                 Role       School
Name
Kelly  Director of HR          NaN
Sally  Course liasion  Engineering
James          Grader     Business

In [ ]:
pd.merge(staff_df, student_dfpd.merge(staff_df, student_df, how='left', left_index=True, right_index=True), how='right', left_index=True, right_index=True)